# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

import re  
tpl = '[1-4]'
while True:
    quarter = input('Введите четверть плоскости координат: ')
    if re.match(tpl, quarter):  # Для интереса сделал проверку вводимых значений через регулрку.
        if quarter == '1':
            print('Возможные координаты: \nх: от больше 0 до положительной бесконечности;\ny: от больше 0 до положительной бесконечности;')
        elif quarter == '2':
            print('Возможные координаты: \nх: от меньше 0 до отрицательной бесконечности;\ny: от больше 0 до положительной бесконечности;')
        elif quarter == '3':
            print('Возможные координаты: \nх: от меньше 0 до отрицатьльной бесконечности;\ny: от меньше 0 до отрицательной бесконечности;')
        else:
            print('Возможные координаты: \nх: от больше 0 до положительной бесконечности;\ny:l от меньше 0 до отрицательной бесконечности;')
        break
    else:
        print('Введена не корректная четверть, укажите значение от 1 до 4.')
