# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

while True:
    day_number = input('Введите номер дня недели: ')
    if day_number in ('1', '2', '3', '4', '5', '6', '7'):
        if day_number in ('6', '7'):
            print('Ура! Это выходной!')
        else:
            print('Пора идти на работу :(')
        break
    else:
        print('Вы ввели некорректные данные, попробуйте еще раз!')
